// 부동소수점과 실수계산 오차

// 자바스크립트의 number 자료형은 부동소수점 사용

// IEEE 754 표준 double 형식 (64비트)
// 자바스크립트에는 기본 정수 자료형이 없음
// BigInt (내장 객체) - 이후 배울 것

console.log(
  0.1 + 0.2,
  0.1 + 0.2 === 0.3
); // 0.30000000000000004 false

let x = 0.1 * 10;
let y = 0.1 + 0.1 + 0.1 + 0.1 + 0.1
 + 0.1 + 0.1 + 0.1 + 0.1 + 0.1;

console.log(
  x, y, x === y
); // 1 0.9999999999999 false

console.log(
  0.2 * 0.7,
  0.4 * 3,
  0.9 - 0.6,
  0.9 - 0.3
); // 0.13999999999999999 1.2000000000000002 0.30000000000000004 0.6000000000000001

// 2의 거듭제곱으로 나눈 수의 계산은 정확
console.log(
  0.25 * 0.5,
  0.5 + 0.25 + 0.125 + 0.125,
  0.0625 / 0.25
); // 0.125 1 0.25


